/**********************************************************************
* 版权所有 (C)2015, Zhou Zhaoxiong。
*
* 文件名称：BigOrLittleEndian1.c
* 文件标识：无
* 内容摘要：测试系统是大端模式还是小端模式
* 其它说明：无
* 当前版本：V1.0
* 作    者：Zhou Zhaoxiong
* 完成日期：20151109
*
**********************************************************************/
#include <stdio.h>

// 重定义数据类型
typedef unsigned char  UINT8;
typedef signed   int   INT32;
typedef unsigned int   UINT32;

// 函数声明
void CheckCPUEndian();


/**********************************************************************
* 功能描述：主函数
* 输入参数：无
* 输出参数：无
* 返 回 值：无
* 其它说明：无
* 修改日期        版本号      修改人              修改内容
* ---------------------------------------------------------------
* 20151109        V1.0     Zhou Zhaoxiong          创建
***********************************************************************/
INT32 main()
{
    CheckCPUEndian();
    
    return 0; 
}


/**********************************************************************
* 功能描述：验证系统的大小端模式
* 输入参数：无
* 输出参数：无
* 返 回 值：无
* 其它说明：无
* 修改日期        版本号      修改人              修改内容
* ---------------------------------------------------------------
* 20151109        V1.0     Zhou Zhaoxiong          创建
***********************************************************************/
void CheckCPUEndian()
{
    union
    {
        UINT32 iInteger;
        UINT8  szStr[4];
    } U_Test;       // 共用体中两个不同的变量共同占用一段内存

    U_Test.iInteger = 0x12345678;
    
    printf("系统是%s!\n", (0x12 == U_Test.szStr[0]) ? "大端模式" : "小端模式");
}

